{
    "title": "Why Me?",
    "comment": "This story was not submitted to any contest, or any publishing site. I had an idea, and wrote the story. And here it is.",
    "paras": [
        "“Why me?” she asked. Julie looked across her living room at the Devil, seated in her favorite easy chair, drinking the sherry she had just poured him. “I assume there’s a reason you chose me in particular.”",
        "The Devil sighed, running his fingers through perfect jet black hair. He began humming softly. Julie recognized the tune: the chorus from “You’re So Vain”.",
        "“Do you really think you’re so special? My agents are visiting thousands of people, even now.” The Devil’s voice was surprisingly soft, and at the moment, sounded distinctly bored. Julie knew better.",
        "“Your agents are out there, but you are here. Personally. So again I ask, why me?”",
        "The Devil looked directly into her eyes. “I think you already have an answer to that, don’t you?”",
        "Julie did. She had been preparing for this moment all of her adult life. From her first college courses in philosophy, mythology, and religious studies, she had spent all her energy on researching the truth underlying the concepts of heaven and hell, of gods and demons. Now in her retirement, she was still considered the world’s foremost expert on the subject of the afterlife across all of the major religions.",
        "That was why she immediately recognized the Devil when she first saw him, lounging in her living room. No human guise, no false face, could fool her.",
        "The Devil continued on, “Besides, it’s not often that a person, upon first seeing me in their home, would actually offer me a drink! Lovely sherry, by the way.”",
        "“Enough of that,” growled Julie. “We both know why you’re really here. You want a challenge. A fair fight, with someone who is ready for you and anything you could possibly throw at me. I’ve studied you. Whatever deals you offer, any of your hidden terms and tricks, I’m ready for them.”",
        "The Devil finished his drink, then looked up at Julie and grinned. “So it’s to be a grand game of chess between us, and you hold all the cards.”",
        "“Exac—wait, no, that’s — that doesn’t make sense. Are you even trying?”",
        "The Devil stood, empty glass in hand, and started slowly pacing the room. “Is it your move yet? Have we started our philosophical debate?” His constant supercilious grin was starting to get under Julie’s skin.",
        "“Oh, no sir. You start. You’re supposed to present me the deal of a lifetime, or offer to solve all my woes. But I’ve done the research. I know all the stories, and I can rationally counter anything you can throw at me.”",
        "The Devil stopped his pacing, and looked back over his shoulder at Julie. “Anything?”",
        "“Yes. With knowledge, logic, and reason, I’m ready for you. You know it’s true. That’s why you came here tonight.”",
        "He turned to face her, and slowly advanced. “Very well then. My first move, as it were. I’ll start with a word. Just one. I doubt I’ll need more.”",
        "The Devil had come within an inch of Julie’s face, staring into her eyes. In barely a whisper, he told her, “Josephine.”",
        "Julie’s composure crumbled, and her breathing turned ragged. “No! Don’t you bring her into this!”  Thoughts and memories raced through her mind, chasing away her facts and her strategies. “How dare you! My daughter is gone, and there’s no way you could have her!”",
        "At that, the Devil chuckled. “Oh, I see,” he drawled. “Where are your ‘rational arguments’ now? Did your stories not prepare you for this? That I might simply offer to release a young woman’s soul… in exchange for another?”",
        "The Devil stepped away from Julie, to the open bottle of sherry on the sideboard, and helped himself to a refill. “You expected riddles and tricks, mind games played for my own amusement. But did you miss the most important point?",
        "I aim for the heart.",
        "It’s your move now, Julia. Where does all your preparation lead you now?”",
        "The Devil took a slow sip from his glass. Julie breathed deeply, once, twice. Her hands stopped trembling, and as she faced him, unblinking, she felt her composure return.",
        "“What are your terms?”"
    ]
}